Layihəni ətraflı analiz edib, detalı README yazıldı
